RedditClone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "alot"], ["url", "akoteo"], ["content", "teojifjoe"], ["user_id", 1], ["created_at", "2019-04-09 20:48:22.067935"], ["updated_at", "2019-04-09 20:48:22.067935"]]

  def edit
    @post = current_user.posts.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 5], ["LIMIT", 1]]

  def update
    @post = current_user.posts.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 6], ["LIMIT", 1]]