RedditClone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "apple"], ["updated_at", "2019-04-09 18:33:17.822138"], ["id", 1]]
---
  def update
    @sub = Sub.find(params[:id])
    if @sub.update(sub_params)